//KQL query that searches for passwords that have been involved in breaches - by PythonSentinel

let breach_passwords = 
    // Load the list of breached passwords
    externaldata (Password:string) [@"https://raw.githubusercontent.com/danielmiessler/SecLists/master/Passwords/Common-Credentials/10-million-password-list-top-10000.txt"] with (format="text")
    // Project the password to a column named Password
    | project Password;
    
// Search for passwords that have been breached
search in (union withsource=t *
    // Query the SecurityEvent table for successful logon events
    SecurityEvent
    | where EventID == 4624 and AccountType == 'User'
    // Extract the account name and password from the message
    | extend Account = tostring(split(split(Message, 'Logon Type:', 2)[1], 'Logon GUID:', 2)[0]), Password = tostring(split(split(Message, 'Account Name:', 2)[1], 'Account Domain:', 2)[0])
    // Join with the list of breached passwords
    | join kind=innerunique breach_passwords on Password
    // Project the username, password, and time
    | project Account, Password, TimeGenerated
    )
| project Account, Password, TimeGenerated;
