// Author: PythonSentinel
// Find passwords that have not changed in a defined time currently set to 90 days
let password_change_interval_days = 90;
let password_change_interval_seconds = password_change_interval_days * 86400;
let password_change_events = SecurityEvent
    | where EventID == 4724 or EventID == 4738 // Password change events
    | summarize max(TimeGenerated) by AccountName
    | project AccountName, LastPasswordChangeTime = max_TimeGenerated
    ;
let password_policy_events = SecurityEvent
    | where EventID == 4706 // Password policy events
    | extend PasswordChangeIntervalSeconds = extract(@"MaximumPasswordAge=(\d+)", 1, TargetUserName)
    | project AccountName = TargetUserName, PasswordChangeIntervalSeconds
    ;
let passwords_not_changed = password_policy_events
    | join kind=leftouter password_change_events on AccountName
    | extend PasswordExpirationTime = LastPasswordChangeTime + PasswordChangeIntervalSeconds
    | where PasswordExpirationTime < now() - password_change_interval_seconds
    | project AccountName, PasswordExpirationTime
    ;
passwords_not_changed
