// Search for events that indicate a failed login attempt - by PythonSentinel
SecurityEvent
| where EventID == 4625

// Filter by login type (interactive and remote)
| where LogonType in (2,10)

// Extract the username and password fields
| extend Username = tostring(split(split(AccountName, "\\")[1], "@")[0]), Password = tostring(extract(@"\s{1}([^\s]+)$", 0, AccountName))

// Filter by weak passwords ( basic list, expand as you wish)
| where Password in~ ("password", "123456", "admin", "qwerty", "letmein")
